; domain
;; Define the domain for a healthcare logistics problem
;; Tested with fast forward
(define (domain healthcare)
  (:requirements :strips :typing)

  ;; Define types used in the domain
  (:types 
    location  ;; General type for locations
    medical_unit - location  ;; A medical unit is a specific type of location
    box  ;; Represents a container for supplies
    content  ;; Represents the type of medical supply
    delivery_robot accompany_robot - robot  ;; Two types of robots: delivery and accompanying
    patient  ;; Represents a patient who may need to be transported
  )

  ;; Define predicates to describe the state of the system
  (:predicates
    (robot_at ?r - robot ?l - location)  ;; A robot is at a specific location
    (medical_supplied ?m - medical_unit ?c - content)  ;; A medical unit has received a supply
    (needs_supply ?m - medical_unit ?c - content)  ;; A medical unit requires a supply
    (contains ?b - box ?c - content)  ;; A box contains a specific type of content
    (robot_carries ?r - robot ?b - box)  ;; A robot is carrying a box
    (at_box ?b - box ?l - location)  ;; A box is at a specific location
    (connected ?l1 - location ?l2 - location)  ;; Two locations are connected
    (hands_free ?r - delivery_robot)  ;; A delivery robot is not carrying a box
    ;; Patient management predicates
    (free_to_accompany ?r - accompany_robot)  ;; An accompanying robot is available to assist a patient
    (accompanying_pat ?p - patient ?ar - accompany_robot)  ;; A patient is being accompanied by a robot
    (patient_at ?p - patient ?l - location)  ;; A patient is at a specific location
  )

  ;; Action: Move a robot from one location to another
  (:action move
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot_at ?r ?from) (connected ?from ?to))  ;; The robot must be at the source location and the locations must be connected
    :effect (and (not (robot_at ?r ?from)) (robot_at ?r ?to))  ;; The robot's location is updated
  )

  ;; Action: Load a box onto a delivery robot
  (:action load_box
    :parameters (?r - delivery_robot ?b - box ?l - location)
    :precondition (and (robot_at ?r ?l) (at_box ?b ?l) (hands_free ?r))  ;; The robot must be at the location, the box must be there, and the robot must have free hands
    :effect (and (not (at_box ?b ?l)) (not (hands_free ?r)) (robot_carries ?r ?b))  ;; The robot now carries the box, and its hands are no longer free
  )

  ;; Action: Unload a box from a delivery robot
  (:action unload_box
    :parameters (?r - delivery_robot ?b - box ?l - location)
    :precondition (and (robot_at ?r ?l) (robot_carries ?r ?b))  ;; The robot must be at the location and carrying the box
    :effect (and (not (robot_carries ?r ?b)) (hands_free ?r) (at_box ?b ?l))  ;; The box is placed at the location, and the robot's hands are free
  )

  ;; Action: Deliver the contents of a box to a medical unit if the unit needs it
  (:action unload_content
    :parameters (?r - delivery_robot ?b - box ?m - medical_unit ?c - content)
    :precondition (and 
      (robot_at ?r ?m)  ;; The robot must be at the medical unit
      (at_box ?b ?m)  ;; The box must be at the medical unit
      (contains ?b ?c)  ;; The box must contain the required content
      (needs_supply ?m ?c)  ;; The medical unit must need the supply
    )
    :effect (and 
      (not (contains ?b ?c))  ;; The box no longer contains the content
      (medical_supplied ?m ?c)  ;; The medical unit has received the supply
    )
  )

  ;; Action: Pick up a patient for transport to a medical unit
  ;; The patient's position is inferred from the accompanying robot
  (:action take_patient
    :parameters (?ar - accompany_robot ?w - location ?p - patient)
    :precondition (and (robot_at ?ar ?w) (free_to_accompany ?ar) (patient_at ?p ?w))  ;; The robot must be at the same location as the patient and be available
    :effect (and (not (patient_at ?p ?w)) (not (free_to_accompany ?ar)) (accompanying_pat ?p ?ar))  ;; The patient is now being accompanied by the robot
  )

  ;; Action: Deliver a patient to a medical unit
  (:action deliver_patient
    :parameters (?ar - accompany_robot ?m - medical_unit ?p - patient)
    :precondition (and (robot_at ?ar ?m) (accompanying_pat ?p ?ar))  ;; The robot must be at the medical unit and currently accompanying the patient
    :effect (and (not (accompanying_pat ?p ?ar)) (free_to_accompany ?ar) (patient_at ?p ?m))  ;; The patient is now at the medical unit, and the robot is free
  )
)

; problem
;; Define the healthcare logistics problem
(define (problem healthcare-problem)
  (:domain healthcare)  ;; The problem belongs to the "healthcare" domain

  ;; Define objects used in the problem
  (:objects
    central_warehouse entrance location1 location2 location3 - location  ;; Locations in the environment
    scalpel tongue_depressor aspirin - content  ;; Different types of medical supplies
    box1 box2 box3 box4 box5 - box  ;; Boxes that contain medical supplies
    delivery_robot1 - delivery_robot  ;; Delivery robot responsible for transporting supplies
    accompany_robot1 - accompany_robot  ;; Accompanying robot responsible for patient transport
    patient1 patient2 - patient  ;; Patients who need to be transported
    medical_unit1 medical_unit2 medical_unit3 - medical_unit  ;; Medical units where patients and supplies need to be delivered
  )

  ;; Define the initial state of the environment
  (:init
    ;; Initial positions of the robots
    (robot_at delivery_robot1 central_warehouse)  ;; The delivery robot starts at the central warehouse
    (robot_at accompany_robot1 entrance)  ;; The accompanying robot starts at the entrance
    (free_to_accompany accompany_robot1)  ;; The accompanying robot is initially free
    (hands_free delivery_robot1)  ;; The delivery robot is initially not carrying anything

    ;; Initial positions of the patients
    (patient_at patient1 entrance)  ;; Patient 1 starts at the entrance
    (patient_at patient2 entrance)  ;; Patient 2 starts at the entrance

    ;; Initial positions of the boxes
    (at_box box1 central_warehouse)
    (at_box box2 central_warehouse)
    (at_box box3 central_warehouse)
    (at_box box4 central_warehouse)
    (at_box box5 central_warehouse)

    ;; Contents of the boxes
    (contains box1 scalpel)  ;; Box 1 contains a scalpel
    (contains box2 tongue_depressor)  ;; Box 2 contains a tongue depressor
    (contains box3 aspirin)  ;; Box 3 contains aspirin
    (contains box4 scalpel)  ;; Box 4 contains a scalpel
    (contains box5 aspirin)  ;; Box 5 contains aspirin

    ;; Define the medical unit supply requirements
    (needs_supply medical_unit1 scalpel)  ;; Medical unit 1 requires a scalpel
    (needs_supply medical_unit1 aspirin)  ;; Medical unit 1 requires aspirin
    ;; Medical unit 2 does not require any supplies, so it is not included here
    (needs_supply medical_unit3 aspirin)  ;; Medical unit 3 requires aspirin

    ;; Define bidirectional connections between locations
    (connected central_warehouse location1)
    (connected location1 central_warehouse)

    (connected location1 location2)
    (connected location2 location1)

    (connected location2 entrance)
    (connected entrance location2)

    (connected entrance location1)
    (connected location1 entrance)

    (connected location1 medical_unit1)
    (connected medical_unit1 location1)

    (connected location2 medical_unit2)
    (connected medical_unit2 location2)

    (connected location3 medical_unit3)
    (connected medical_unit3 location3)

    (connected location2 location3)
    (connected location3 location2)

    ;; Uncomment these lines if direct connections from the entrance to medical units are needed
    ;(connected entrance medical_unit1)
    ;(connected entrance medical_unit2)
    ;(connected entrance medical_unit3)
  )

  ;; Define the goal conditions
  (:goal
    (and
      ;; Medical units must receive only the supplies they need
      (medical_supplied medical_unit1 scalpel)
      (medical_supplied medical_unit1 aspirin)
      (medical_supplied medical_unit3 aspirin)

      ;; Patients must be transported to the appropriate medical units
      (patient_at patient1 medical_unit1)
      (patient_at patient2 medical_unit2)
    )
  )
)

; plan
1. (take_patient accompany_robot1 entrance patient1)
   deleted: (patient_at patient1 entrance) (free_to_accompany accompany_robot1)
   added: (accompanying_pat patient1 accompany_robot1)
   goals met: 0 of 5
2. (move accompany_robot1 entrance location1)
   deleted: (robot_at accompany_robot1 entrance)
   added: (robot_at accompany_robot1 location1)
   goals met: 0 of 5
3. (move accompany_robot1 location1 medical_unit1)
   deleted: (robot_at accompany_robot1 location1)
   added: (robot_at accompany_robot1 medical_unit1)
   goals met: 0 of 5
4. (deliver_patient accompany_robot1 medical_unit1 patient1)
   deleted: (accompanying_pat patient1 accompany_robot1)
   added: (free_to_accompany accompany_robot1) (patient_at patient1 medical_unit1)
   goals met: 1 of 5
5. (move accompany_robot1 medical_unit1 location1)
   deleted: (robot_at accompany_robot1 medical_unit1)
   added: (robot_at accompany_robot1 location1)
   goals met: 1 of 5
6. (move accompany_robot1 location1 location2)
   deleted: (robot_at accompany_robot1 location1)
   added: (robot_at accompany_robot1 location2)
   goals met: 1 of 5
7. (move accompany_robot1 location2 entrance)
   deleted: (robot_at accompany_robot1 location2)
   added: (robot_at accompany_robot1 entrance)
   goals met: 1 of 5
8. (take_patient accompany_robot1 entrance patient2)
   deleted: (patient_at patient2 entrance) (free_to_accompany accompany_robot1)
   added: (accompanying_pat patient2 accompany_robot1)
   goals met: 1 of 5
9. (move accompany_robot1 entrance location2)
   deleted: (robot_at accompany_robot1 entrance)
   added: (robot_at accompany_robot1 location2)
   goals met: 1 of 5
10. (move accompany_robot1 location2 medical_unit2)
   deleted: (robot_at accompany_robot1 location2)
   added: (robot_at accompany_robot1 medical_unit2)
   goals met: 1 of 5
11. (deliver_patient accompany_robot1 medical_unit2 patient2)
   deleted: (accompanying_pat patient2 accompany_robot1)
   added: (free_to_accompany accompany_robot1) (patient_at patient2 medical_unit2)
   goals met: 2 of 5
12. (load_box delivery_robot1 box1 central_warehouse)
   deleted: (at_box box1 central_warehouse) (hands_free delivery_robot1)
   added: (robot_carries delivery_robot1 box1)
   goals met: 2 of 5
13. (move delivery_robot1 central_warehouse location1)
   deleted: (robot_at delivery_robot1 central_warehouse)
   added: (robot_at delivery_robot1 location1)
   goals met: 2 of 5
14. (move delivery_robot1 location1 medical_unit1)
   deleted: (robot_at delivery_robot1 location1)
   added: (robot_at delivery_robot1 medical_unit1)
   goals met: 2 of 5
15. (unload_box delivery_robot1 box1 medical_unit1)
   deleted: (robot_carries delivery_robot1 box1)
   added: (hands_free delivery_robot1) (at_box box1 medical_unit1)
   goals met: 2 of 5
16. (unload_content delivery_robot1 box1 medical_unit1 scalpel)
   deleted: (contains box1 scalpel)
   added: (medical_supplied medical_unit1 scalpel)
   goals met: 3 of 5
17. (move delivery_robot1 medical_unit1 location1)
   deleted: (robot_at delivery_robot1 medical_unit1)
   added: (robot_at delivery_robot1 location1)
   goals met: 3 of 5
18. (move delivery_robot1 location1 central_warehouse)
   deleted: (robot_at delivery_robot1 location1)
   added: (robot_at delivery_robot1 central_warehouse)
   goals met: 3 of 5
19. (load_box delivery_robot1 box3 central_warehouse)
   deleted: (at_box box3 central_warehouse) (hands_free delivery_robot1)
   added: (robot_carries delivery_robot1 box3)
   goals met: 3 of 5
20. (move delivery_robot1 central_warehouse location1)
   deleted: (robot_at delivery_robot1 central_warehouse)
   added: (robot_at delivery_robot1 location1)
   goals met: 3 of 5
21. (move delivery_robot1 location1 medical_unit1)
   deleted: (robot_at delivery_robot1 location1)
   added: (robot_at delivery_robot1 medical_unit1)
   goals met: 3 of 5
22. (unload_box delivery_robot1 box3 medical_unit1)
   deleted: (robot_carries delivery_robot1 box3)
   added: (hands_free delivery_robot1) (at_box box3 medical_unit1)
   goals met: 3 of 5
23. (unload_content delivery_robot1 box3 medical_unit1 aspirin)
   deleted: (contains box3 aspirin)
   added: (medical_supplied medical_unit1 aspirin)
   goals met: 4 of 5
24. (move delivery_robot1 medical_unit1 location1)
   deleted: (robot_at delivery_robot1 medical_unit1)
   added: (robot_at delivery_robot1 location1)
   goals met: 4 of 5
25. (move delivery_robot1 location1 central_warehouse)
   deleted: (robot_at delivery_robot1 location1)
   added: (robot_at delivery_robot1 central_warehouse)
   goals met: 4 of 5
26. (load_box delivery_robot1 box5 central_warehouse)
   deleted: (at_box box5 central_warehouse) (hands_free delivery_robot1)
   added: (robot_carries delivery_robot1 box5)
   goals met: 4 of 5
27. (move delivery_robot1 central_warehouse location1)
   deleted: (robot_at delivery_robot1 central_warehouse)
   added: (robot_at delivery_robot1 location1)
   goals met: 4 of 5
28. (move delivery_robot1 location1 location2)
   deleted: (robot_at delivery_robot1 location1)
   added: (robot_at delivery_robot1 location2)
   goals met: 4 of 5
29. (move delivery_robot1 location2 location3)
   deleted: (robot_at delivery_robot1 location2)
   added: (robot_at delivery_robot1 location3)
   goals met: 4 of 5
30. (move delivery_robot1 location3 medical_unit3)
   deleted: (robot_at delivery_robot1 location3)
   added: (robot_at delivery_robot1 medical_unit3)
   goals met: 4 of 5
31. (unload_box delivery_robot1 box5 medical_unit3)
   deleted: (robot_carries delivery_robot1 box5)
   added: (hands_free delivery_robot1) (at_box box5 medical_unit3)
   goals met: 4 of 5
32. (unload_content delivery_robot1 box5 medical_unit3 aspirin)
   deleted: (contains box5 aspirin)
   added: (medical_supplied medical_unit3 aspirin)
   goals met: 5 of 5
